<?php
// +----------------------------------------------------------------------------------------------------------------
// | 1、代码文件必须以 <?php 或 <?= 标签开始，在PHP代码中统一使用<?php,在模板中统一使用<?=
// +----------------------------------------------------------------------------------------------------------------
// | 2、PHP代码文件必须以 不带BOM的 UTF-8 编码；
// +----------------------------------------------------------------------------------------------------------------
// | 3、遵循框架命名规则;
//      否则使用如下文件命名方式,文件大小最多不超过100M：
//      日志实例：runtime/log/201701/01/error.01.log
//      缓存实例：runtime/cache/201701/01/date.01.cache
// +----------------------------------------------------------------------------------------------------------------
// | 4、类的命名必须遵循 StudlyCaps 大写开头的驼峰命名规范；
// +----------------------------------------------------------------------------------------------------------------
// | 5、方法名称必须符合 camelCase 式的小写开头驼峰命名规范。
// +----------------------------------------------------------------------------------------------------------------
// | 6、类中的常量所有字母都必须大写，单词间用下划线分隔；
// +----------------------------------------------------------------------------------------------------------------
// | 7、方法名称必须符合 camelCase 式的小写开头驼峰命名规范；
// +----------------------------------------------------------------------------------------------------------------

/**
 * Class Name StandFunctionsPhp.php
 * @author     : zhaotong
 * @email      : zhaotong <zhaotongkp#163.com>
 * @date       : 2017/1/19 14:27
 * @description: 标准PHP SR-2/4实例
 *             文件要使用4空格代替tab制表符键码
 */
//if与{的关系是在一行的，并且在{前要有一个空格
//if与}的关系是在一列的，要对其
if (function_exists('getCallName')) {
    /**
     * @author :zhaotong
     * @email  :zhaotong <zhaotongkp#163.com>
     * @date   :2017/1/19 14:27
     * @return string
     */
    function getCallName()
    {
        $name = 'zhaotong';
        $emailPrefix = '#163.com';
        //连接字符串的. 前后要有空格
        return $name . $emailPrefix;
    }
}
/**
 * get standard function php demo
 * @param string $city   城市
 * @param array $country 乡村
 * @param string $stree  街道
 * @description:这是一个标准的实例，请参考这样书写代码。
 */
function getStandFunctionPhp($city, $country = array(), $stree = '')
{
    if ('hebeisheng' == $city) {
        $city = "This is my " . $city;
    }
    //if语句块中，如果是空白的，那么不要有任何空格字符
    if ('baoding' == $country) {
    }
}

/**
 * 类文件及functions.php 文件，文件末尾不能写 ?> ,并且要留有空白行
 * 纯PHP代码文件必须省略最后的?>结束标签。
 */
?>