<?php
// +----------------------------------------------------------------------------------------------------------------
// | 1、代码文件必须以 <?php 或 <?= 标签开始，在PHP代码中统一使用<?php,在模板中统一使用<?=
// +----------------------------------------------------------------------------------------------------------------
// | 2、PHP代码文件必须以 不带BOM的 UTF-8 编码；
// +----------------------------------------------------------------------------------------------------------------
// | 3、遵循框架命名规则;
//      否则使用如下文件命名方式,文件大小最多不超过100M：
//      日志实例：runtime/log/201701/01/error.01.log
//      缓存实例：runtime/cache/201701/01/date.01.cache
// +----------------------------------------------------------------------------------------------------------------
// | 4、类的命名必须遵循 StudlyCaps 大写开头的驼峰命名规范；
// +----------------------------------------------------------------------------------------------------------------
// | 5、方法名称必须符合 camelCase 式的小写开头驼峰命名规范。
// +----------------------------------------------------------------------------------------------------------------
// | 6、类中的常量所有字母都必须大写，单词间用下划线分隔；
// +----------------------------------------------------------------------------------------------------------------
// | 7、方法名称必须符合 camelCase 式的小写开头驼峰命名规范；
// +----------------------------------------------------------------------------------------------------------------

/**
 * Class Name StandNameSpacephp.php
 * @author     : zhaotong
 * @email      : zhaotong <zhaotongkp#163.com>
 * @date       : 2017/1/19 14:27
 * @description: 标准PHP SR-2/4实例
 */
/**
 * namespace class name 要小写
 */
namespace standphpclass;

/**
 * Class StandNameSpacePhp
 * @package standphpclass
 * @description
 */
//implements的继承列表也可以分成多行，这样的话，每个继承接口名称都必须分开独立成行，包括第一个。
class StandNameSpacePhp extends ParentClass implements
    \ArrayAccess,
    \Countable,
    \Serializable
{
    
}

/**
 * 类文件及functions.php 文件，文件末尾不能写 ?> ,并且要留有空白行
 * 纯PHP代码文件必须省略最后的?>结束标签。
 */